<template>
    <section class="service-block col-12">
        <div class="container">
            <div class="row">
                <div class="service">
                    <cosmetology-l-service-card :services="services" />
                </div>
            </div>
        </div>
    </section>
</template>

<script>
import CosmetologyLServiceCard from "../components/service/CosmetologyLServiceCard.vue";
export default {
    name: "ServiceView",
    components: { CosmetologyLServiceCard },
    data() {
        return {
            services: [
                {
                    title: "Пилинги",
                    refer: "pilings",
                    info: "Пилинг в косметологии — удаление, отшелушивание верхнего ороговевшего слоя кожи. Любой вид пилинга истончает роговой слой, удаляет мелкие комедоны, облегчает доступ к более глубоким слоям кожи, расширяет поры и смягчает кожу, что часто делает пилинг подготовительным процессом для последующих процедур. Также пилинг усиливает деление клеток базального слоя, и кожа становится гладкой и светлой, приобретая более молодой и здоровый вид.",
                    description: "",
                    category: [
                        {
                            title: "TC PLUC",
                            text: "",
                            price: "650",
                        },
                        {
                            title: "PRX T33",
                            text: "",
                            price: "1600",
                        },
                        {
                            title: "Perfect Tri-Clarity",
                            text: "анти-акне",
                            price: "650",
                        },
                        {
                            title: "Power Pumpkin Resurfacer",
                            text: "тыквенный пилинг",
                            price: "700",
                        },
                        {
                            title: "Салициловый пилинг",
                            text: "жырная кожа",
                            price: "550",
                        },
                        {
                            title: "Миндальный пилинг",
                            text: "сухая кожа",
                            price: "550",
                        },
                        {
                            title: "Yellow Lightening",
                            text: "устранение",
                            text1: "гиперпигментации + лифтинг",
                            price: "2000",
                        },
                        {
                            title: "Pineapple Pumpkin Peel",
                            text: "выравнивание тона для",
                            text1: "чувствительной кожи",
                            price: "600",
                        },
                        {
                            title: "TCA 25% Skin Peel",
                            text: "Сушение пор + лифтинг",
                            price: "700",
                        },
                    ],
                },
                {
                    title: "Эстетика. Основной прайс",
                    refer: "estet",
                    info: "Очищение – один из важнейших этапов ухода за лицом. Эффективность применения косметических средств напрямую зависит от свойства кожи усваивать витамины, антиоксиданты и другие полезные компоненты. В домашних условиях невозможно устранить ороговевший слой и активизировать клеточное дыхание. Если своевременно не убрать отмершие клетки, цвет лица становится тусклым и неравномерным, снижается упругость и эластичность тканей. Вернуть и поддержать свежий и здоровый вид лица поможет чистка и ряд уходовых процедур по типу кожи.",
                    description: "",
                    category: [
                        {
                            title: "Чистка лица",
                            text: "",
                            price: "600",
                        },
                        {
                            title: "Чистка лица & Пилинг",
                            text: "",
                            price: "700",
                        },
                        {
                            title: "Intansive Hydration",
                            text: "уход для сухой,",
                            text1: "обезвоженой кожи",
                            price: "600",
                        },
                        {
                            title: "Power Pumpkin Resurfacer",
                            text: "тыквенный пилинг",
                            price: "700",
                        },
                        {
                            title: "AcneStop",
                            text: "уход за жирной",
                            text1: "проблемной кожей",
                            text2: "с воспалениями",
                            price: "600",
                        },
                        {
                            title: "Миндальный пилинг",
                            text: "сухая кожа",
                            price: "550",
                        },
                        {
                            title: "Face Fitness",
                            text: "массаж лица",
                            price: "400",
                        },
                        {
                            title: "Pineapple Pumpkin Peel",
                            text: "выравнивание тона для",
                            text1: "чувствительной кожи",
                            price: "600",
                        },
                        {
                            title: "Карбокситерапия",
                            price: "600",
                        },
                        {
                            title: "White Skin",
                            text: "осветляющая процедура",
                            price: "500",
                        },
                        {
                            title: "Альгинатная маска",
                            text: "массаж лица",
                            price: "350",
                        },
                    ],
                },
                {
                    title: "Ботулинотерапия. Ботокс & Нейронокс",
                    refer: "botex",
                    info: "Ботулинотерапия — это инъекционный метод разглаживания морщин с помощью ботулотоксинов. Каков принцип его действия? Ботулотоксин действует локально и вызывает мышечное расслабление. Действует он именно на ту мышцу, в которую вводится препарат. Чаще всего с помощью ботулинотерапии разглаживают морщины на лбу, в межбровной области, вокруг глаз (так называемые «гусиные лапки»).",
                    description: "",
                    category: [
                        {
                            titleMain: "Комплекс",
                            title: "Лоб & межбровье & глаза",
                            text: "",
                            price: "3500",
                        },
                        {
                            title: "Лоб & межбровье",
                            text: "",
                            price: "2500",
                        },
                        {
                            titleMain: "Зоны отдельно",
                            title: "Лоб",
                            text: "",
                            text1: "",
                            price: "1500",
                        },
                        {
                            title: "Межбровье",
                            text: "",
                            price: "1500",
                        },
                        {
                            title: "Глаза",
                            text: "",
                            price: "1500",
                        },
                        {
                            titleMain: "Лечение",
                            title: "Гипергидроз подмышечных впадин",
                            text: "повышеная потливость",
                            price: "5000",
                        },
                    ],
                },
                {
                    title: "SMAS-lifting",
                    refer: "smas",
                    info: "Ультразвуковой СМАС-лифтинг — это технология многоуровневого омоложения за счет воздействия высокоинтенсивным сфокусированным ультразвуком. Фокусированный ультразвук (HIFU) — это единственная в косметологии технология, которая позволяет работать не только с кожей и подкожной жировой клетчаткой, но и со SMAS-слоем (Superficial Muscle-Aponeurotic System), который является каркасом и препятствует возрастному опущению тканей. Фокусированный ультразвук точечно и эффективно прогревает SMAS, что приводит к его резкому сокращению и, как следствие, выраженному лифтингу.",
                    description:
                        "Альтернатива пластической хирургии. Результат 1-1.5 года",
                    category: [
                        {
                            title: "Лицо полностью",
                            text: "",
                            price: "250",
                        },
                        {
                            title: "Средняя и нижняя треть",
                            text: "",
                            price: "170",
                        },
                        {
                            title: "Глаза",
                            text: "",
                            price: "100",
                        },
                    ],
                },
                {
                    title: "Контурная пластика лица",
                    refer: "face",
                    info: "Контурная пластика лица – это процедура коррекции рельефа кожи с помощью специальных наполнителей (филлеров). Наряду с механическим заполнением дефекта (морщины, шрамы), они увлажняет глубокие слои дермы, возвращая коже прежнюю упругость и цвет. Препараты в виде гелей, которые вводятся инъекционно на различную глубину и применяются в косметологии для восполнения объема мягких тканей пациента, называются филлерами. Их используют для коррекции неровностей кожи, изменения форм и контуров лица. Для минимизации болевых ощущений контурная пластика лица может проводиться под местной анестезией.",
                    description:
                        "Результат от 6-18 месяцев.(Скулы, подбородок, углы нижней челюсти, носогубные складки)",
                    category: [
                        {
                            title: "Saypha Volume 1ml",
                            price: "3000",
                        },
                        {
                            title: "Neauvia Organic Intence LV 1ml",
                            price: "4000",
                        },
                        {
                            title: "Stylage L 1ml",
                            price: "3800",
                        },
                    ],
                },
                {
                    title: "Контурная пластика губ",
                    refer: "lips",
                    info: "Контурная пластика губ Коррекция формы и увеличение губ, восполнение объема, выравнивание контура. Минимальная травматичность, максимально быстрый результат. Безболезненная и безопасная косметологическая процедура контурная пластика губ призвана решать возрастные и эстетические проблемы зоны рта. Деликатное увеличение губ филлерами на основе гиалуроновой кислоты, способно придать им естественный объем, разгладить и увлажнить поверхность, скорректировать форму, убрать кисетные морщинки и приподнять опустившиеся уголки. Качественные препараты для инъекций содержат гиалуроновую кислоту (ГК) неживотного происхождения, родственную нашей коже, что исключает риски побочных эффектов и аллергических реакций.",
                    description:
                        "Результат от 6-18 месяцев.(Смена формі губ, четкость контура, увеличение обЪёма)",
                    category: [
                        {
                            title: "Saypha Crona 1ml",
                            price: "3500",
                        },
                        {
                            title: "Neauvia Organic Intence lips 1ml",
                            price: "4000",
                        },
                        {
                            title: "Perfectha derm/deep 1.1ml",
                            price: "4200",
                        },
                        {
                            title: "Juvederm ULTRA 3 1ml",
                            price: "4400",
                        },
                    ],
                },
                {
                    title: "Мезотерапия & Биоревитализация",
                    refer: "mezo",
                    info: "Мезотерапия — это современная инъекционная методика омоложения. Суть мезотерапии заключается во введении внутрикожно и подкожно витаминов, микроэлементов и других препаратов в зону, с которой работает врач либо же отдаленно от нее. Биоревитализация — это процедура введения препаратов на основе гиалуроновой кислоты в глубинные слои кожи. Гиалуроновая кислота словно магнит притягивает и удерживает воду, которая не дает волокнам эластина и коллагена распадаться.",
                    category: [
                        {
                            title: "Anti-acne",
                            text: "противоспалительный коктейль",
                            price: "30",
                        },
                        {
                            title: "White Skin",
                            text: "отбеливания пигментации,",
                            text1: "постакне",
                            price: "45",
                        },
                        {
                            title: "Shine Skin",
                            text: "увлажнение и сияние",
                            price: "35",
                        },
                        {
                            title: "Saypha Rich",
                            text: "биоревитализация",
                            price: "70",
                        },
                        {
                            title: "Meso-Xanthin F199",
                            text: "детокс кожи",
                            price: "100",
                        },
                        {
                            title: "Meso-Wharton P199",
                            text: "глубокое омолаживание,",
                            text1: "лифтинг",
                            price: "100",
                        },
                        {
                            title: "Hair cocktail",
                            text: "рост волосы головы",
                            price: "750",
                        },
                        {
                            title: "Ферменты ТРИАДА",
                            text: "липолитик",
                            price: "1700",
                        },
                    ],
                },
            ],
        };
    },
    methods: {},
};
</script>
<style lang="scss" scoped>
.service-block {
    overflow-x: hidden;
    width: 100%;
    height: 100vh;
    background-color: rgb(115, 112, 77);
}
.service {
    box-sizing: border-box;
    padding-top: 100px;
    width: 100%;
    display: flex;
    flex-direction: row;
    flex-wrap: wrap;
    padding-bottom: 50px;
    @media (max-width: 750px) {
        padding-top: 60px;
    }
}
</style>
