// Мінімум

/* 1. Запитай у користувача його вік і визначи, ким він є: дитиною (0-2), підлітком (12-18), дорослим (18-60) або пенсіонером (60 ...), передбач можливість введення невірних даних.*/

/* 2. Запитай у користувача число від 0 до 9 і виведи йому спецсимвол, який розташований на цій клавіші (1 !, 2 @, 3 # і т. д).

/* 3. Підрахуй суму всіх чисел в заданому користувачем діапазоні.*/

/* 4. Запитай у користувача 2 числа і знайди найбільший спільний дільник.*/

/* 5. Запитай у користувача число і виведи всі дільники цього числа.*/


// Норма

/* 1. Запитай у користувача п’ятирозрядне число і визначи, чи є воно паліндромом.*/

/* 2. Запитай у користувача суму покупки і виведи суму до оплати зі знижкою:
        від 200 до 300 - знижка буде 3%; 
        від 300 до 500 - 5%;
        від 500 і вище - 7%.
*/

        
/* 3. Запитай у користувача 10 чисел і порахуй, скільки він ввів додатніх, від’ємних і нулів. При цьому також порахуй, скільки з них парних і непарних. Виведи статистику на екран. Враховуй, що достатньо однієї змінної (не 10) для введення чисел користувачем.*/

/* 4. Зацикли висновок днів тижня таким чином: «День тижня. Хочеш побачити наступний день? » і так до тих пір, поки користувач натискає OK.*/


// Максимум

/* 1. Гра «Вгадай число». Запропонуй користувачеві загадати число від 0 до 100 і відгадай його наступним способом: кожну ітерацію циклу діли діапазон чисел навпіл, записуй результат в N і питай у користувача «Ваше число> N, <N або == N?». Залежно від того що вказав користувач, зменшуй діапазон. Початковий діапазон від 0 до 100, поділи навпіл і отримай 50. Якщо користувач вказав, що його число> 50, то зміни діапазон на від 51 до 100. І так до тих пір, поки користувач не вибере == N.*/

/* 2. Виведи таблицю множення для всіх чисел від 2 до 9. Кожне число необхідно помножити на числа від 1 до 10.*/

/* 3. Запитай дату (день, місяць, рік) і виведи наступну за нею дату. Враховуй можливість переходу на наступний місяць, рік, а також високосний рік.*/
