/*------------------------------------------------------------------------------------------------*/
// Минимум

//1. Створи HTML-файл, в ньому пропиши всі можливі способи використання JS;
//   Указанно в index.html!!!

/* 2. Тобі потрібно зберігати ім’я та прізвище в змінній, придумай до 4-х імен змінних, що потрібні тобі для даної задачі.
      Також напиши до 5 неправильних імен (неправильні імена повинні бути закоментовані);*/

const name = 'Ivan';
const surname = 'Ivanov';
const lastname = 'Alexandrovich';
const nikname = 'Ivan';

// Не правильные

/*const 1n ame;
const last name;
const +name;
const LaStNaMe;
const last = name;
const имяпеременной;
*/

//3. Вкажи всі можливі способи коментування коду;

// Однострочный комментарий

/* 
Многострочные комментарии
*/

/**
 * 
 * JS DOCS
 * 
 */

//4. Які стилі написання імен змінних ти знаєш?

/**
 * Camel case - camelCase
 * Snake case - snake_case
 * Kebab case - kebab-case
 * Upper case - UPPER_CASE_SNAKE_CASE
 * Pascal case - PascalCase
 */

/*------------------------------------------------------------------------------------------------*/
//Норма

//1.Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”;

const userName = prompt("Как Вас зовут?");
const hellow = 'Привет ';
console.log(hellow + userName);

/*2.Запитай рік народження користувача, порахуй його/її вік і виведи результат.
    Поточний рік вкажи в коді як константу; */

const date_birth = +prompt("Введите год рождения!");
const year = 2021;
let ege = 2021 - date_birth;

console.log(ege);

//3.Запитай у користувача довжину сторони квадрату і виведи периметр цього квадрата

const storona = +prompt("Введите длену стороны квадрата");
let kvadrat = storona * 4;

console.log(kvadrat);

/*------------------------------------------------------------------------------------------------*/
//Максимум

//1.Запитай у користувача радіус кола і виведи площу такої окружності.

const radius = +prompt("ВВедите радиус круга");
const p = 3.14;
const area = (radius * radius) * p;

console.log(area);

/*3. Запитай у користувача відстань в кілометрах між двома містами і за скільки годин він хоче дістатися.
     Порахуй швидкість, з якою необхідно рухатися, щоб встигнути вчасно. */

const distance = +prompt('Расстояние между городами?');
const time = +prompt('Время?');

const speed = distance / time;

console.log(speed);

/*4. Реалізуй конвертор валют. 
     Користувач вводить долари, програма переводить їх в євро. 
     Курс валют зберігається в константі. */

const dollar = +prompt("Введите сумму");
const kross = 0.89;
const euro = dollar * kross;

console.log(euro);
