"use strict";

// Мінімум

/* 1. Напиши функцію, яка приймає час (години, хвилини, секунди) і виводить його на екран у форматі «гг: хв: сс» .Якщо при виконанні функції хвилини і / або секунди не були надані, то виводити їх як 00. */
function showTime(hh) {
  var mm = arguments.length > 1 && arguments[1] !== undefined ? arguments[1] : 0;
  var ss = arguments.length > 2 && arguments[2] !== undefined ? arguments[2] : 0;
}

showTime(12, 31, 44);
/* 2. Напиши функцію, яка приймає години, хвилини і секунди і повертає цей час в секундах. */

/* 3. Напиши функцію, яка приймає кількість секунд, переводить їх у години, хвилини і секунди і повертає у вигляді рядка «гг: хв: сс». */
// Норма

/* Напиши функцію, яка рахує різницю між датами. Функція приймає 6 параметрів, які описують 2 дати, і повертає результат у вигляді рядка «гг: хв: сс». При виконанні завдання використовуй функції з попередніх 2-х завдань: спочатку обидві дати переведи в секунди, дізнайся різницю в секундах, а потім різницю переведи назад в «гг: хв: сс». */
// Максимум

/* Напиши функцію, яка приймає час (години, хвилини, секунди), повертає функцію, яка замкнута на ці змінні і керує ними. Якщо функції передати, наприклад, 3660 секунд, час має змінитися на 1 г. та 1 хв. */